temp1/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовВДне</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКалендарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>UIDПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчики</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказчикиТЧ</name>
    <attributes>
      <name>ЗаказчикиДляТЧ</name>
      <type>
        <types>CatalogRef.Заказчики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/ПрограммныеПродукты/ПрограммныеПродукты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммныеПродукты</name>
  <owners>Catalog.Заказчики</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛицензиии</name>
    <type>
      <types>CatalogRef.ВидыЛицензий</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПодписки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПодписки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленНовыйСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЛицензии</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>Boolean</types>
        <types>ChartOfCharacteristicTypesRef.СвойстваЛицензий</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствЛицензий</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПинКоды</name>
    <attributes>
      <name>ПинКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАктивации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/Заказчики/Заказчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказчики</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПриоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаЗаказчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУведомлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурирующийМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/CommonModules/ОтправкаОтчетаКонтрольСрокаПодписок/Module.bsl
Процедура ОтправкаОтчетаКонтрольСрокаПодписок() Экспорт
	ТекстПисьма = "Отчет окончания действия подписок" + Символы.ПС;
	ЗаписьЖурналаРегистрации("Регл.задание: Отчет по срокам подписок", УровеньЖурналаРегистрации.Информация, , , "Старт:" + Формат(ТекущаяДата(), "гггг.ММ.дд ЧЧ:мм:сс"), );
	ПутьКФайлу = "C:\Users\Public\";
	ИмяФайла = "temp.xls";
	ПолноеИмяФайла = ПутьКФайлу+ИмяФайла;
	ЗапросСписокМенеджеровДляРассылки = Новый Запрос;
	ЗапросСписокМенеджеровДляРассылки.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователи,
	|	Пользователи.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В
	|			(ВЫБРАТЬ
	|				Заказчики.КурирующийМенеджер КАК КурирующийМенеджер
	|			ИЗ
	|				Справочник.ПрограммныеПродукты КАК ПрограммныеПродукты
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заказчики КАК Заказчики
	|					ПО
	|						ПрограммныеПродукты.Владелец = Заказчики.Ссылка
	|			ГДЕ
	|				ПрограммныеПродукты.ДатаОкончанияПодписки <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, Заказчики.СрокУведомления)
	|				И ПрограммныеПродукты.ВыставленНовыйСчет = ЛОЖЬ)
	|	И НЕ Пользователи.АдресЭП = """"";
	ЗапросСписокМенеджеровДляРассылки.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	СписокМенеджеровДляРассылки = ЗапросСписокМенеджеровДляРассылки.Выполнить().Выгрузить();
	Для Каждого Менеджер из СписокМенеджеровДляРассылки Цикл
		Таб = СоздатьОтчет(ТекстПисьма, Менеджер.Пользователи);
		Попытка
			Таб.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		Исключение
			ЗаписьЖурналаРегистрации("Регл.задание: Отчет по срокам подписок", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось создать файл!" + ОписаниеОшибки(), );
		КонецПопытки;        
		ОтправкаУведомлений(ТекстПисьма, ПолноеИмяФайла, Менеджер.АдресЭП);
	КонецЦикла;
	ЗаписьЖурналаРегистрации("Регл.задание: Отчет по срокам подписок", УровеньЖурналаРегистрации.Информация, , , "Финиш:" + Формат(ТекущаяДата(), "гггг.ММ.дд ЧЧ:мм:сс"), );
КонецПроцедуры

Функция СоздатьОтчет(ТекстПисьма, МенеджерСсылка)
	Таб = Новый ТабличныйДокумент;
	Попытка        
		СхемаКомпоновкиДанных = Отчеты.КонтрольСрокаПодписок.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");    
		НовыйТекстЗапроса =
		"ВЫБРАТЬ
		|	ПрограммныеПродукты.Наименование КАК Наименование,
		|	ПрограммныеПродукты.СерийныйНомер КАК СерийныйНомер,
		|	ПрограммныеПродукты.ВидЛицензиии КАК ВидЛицензиии,
		|	ПрограммныеПродукты.Описание КАК Описание,
		|	ПрограммныеПродукты.ДатаНачалаПодписки КАК ДатаНачалаПодписки,
		|	ПрограммныеПродукты.ДатаОкончанияПодписки КАК ДатаОкончанияПодписки,
		|	ПрограммныеПродукты.Владелец КАК Владелец,
		|	ПрограммныеПродукты.Владелец.КурирующийМенеджер КАК ВладелецКурирующийМенеджер
		|ИЗ
		|	Справочник.ПрограммныеПродукты КАК ПрограммныеПродукты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заказчики КАК Заказчики
		|		ПО ПрограммныеПродукты.Владелец = Заказчики.Ссылка
		|ГДЕ
		|	ПрограммныеПродукты.ДатаОкончанияПодписки <= ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(" + 
		Формат(ТекущаяДата(), "ДФ=гггг") + "," + Месяц(ТекущаяДата()) + "," + День(ТекущаяДата()) + "), ДЕНЬ, Заказчики.СрокУведомления)
		|И ПрограммныеПродукты.ВыставленНовыйСчет = ЛОЖЬ";
		
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = НовыйТекстЗапроса;
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		Расшифровка = Новый ДанныеРасшифровкиКомпоновкиДанных;    
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
		Настройки.Отбор.Элементы[0].Использование = Ложь;
		Настройки.Отбор.Элементы[1].Использование = Ложь;
		ОтборПоМенеджеру = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоМенеджеру.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВладелецКурирующийМенеджер");
		ОтборПоМенеджеру.ПравоеЗначение = МенеджерСсылка;
		ОтборПоМенеджеру.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоМенеджеру.Использование  = Истина;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, Расшифровка);    
		ВнешниеПараметры = Новый Структура;    
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеПараметры, Расшифровка);    
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Таб);    
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
		Возврат Таб;
	Исключение
		ТекстПисьма = ТекстПисьма + "Ошибка при создании отчета! " + ОписаниеОшибки() + Символы.ПС;
		Возврат Таб;
	КонецПопытки;
КонецФункции

Процедура ОтправкаУведомлений(ТекстПисьма, ПолноеИмяФайла, АдресЭПМенеджера)
	УстановитьПривилегированныйРежим(Истина);
	Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты.Ссылка, "Пароль, ПарольSMTP");
	УстановитьПривилегированныйРежим(Ложь);
	Pass = Пароли.ПарольSMTP;
	Отправитель = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	ИПП = Новый ИнтернетПочтовыйПрофиль;
	ИПП.АдресСервераSMTP   = Отправитель.СерверИсходящейПочты;
	ИПП.ПарольSMTP         = Pass;
	ИПП.ПользовательSMTP   = Отправитель.ПользовательSMTP;
	ИПП.ПортSMTP           = 587;            // Отправитель.ПортСервераИсходящейПочты; (по 465 порту выдает ошибку)
	ИПП.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Кодировка = "UTF-8";
	Сообщение.Получатели.Добавить(АдресЭПМенеджера);            	
	Сообщение.Отправитель.Адрес = Отправитель.ПользовательSMTP;
	Сообщение.Тема = "Регл.задание: Отчет по срокам подписок";
	Попытка
		Сообщение.Вложения.Добавить(ПолноеИмяФайла,"Отчет");
	Исключение
		ЗаписьЖурналаРегистрации("Регл.задание: Отчет по срокам подписок", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось добавить вложение!" + ОписаниеОшибки(), );
	КонецПопытки;
	Сообщение.Тексты.Добавить(ТекстПисьма);
	
	ПочтаИсх = Новый ИнтернетПочта;
	Попытка
		ПочтаИсх.Подключиться(ИПП);
		ПочтаИсх.Послать(Сообщение);
	Исключение
		ЗаписьЖурналаРегистрации("Регл.задание: Отчет по срокам подписок", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить письмо! " + ОписаниеОшибки(), );
	КонецПопытки;
	ПочтаИсх.Отключиться();
КонецПроцедуры
